Revit.Elements.Area.InternalElement
Reference to the Element

Revit.Elements.Area.InternalSetArea(Autodesk.Revit.DB.Area)
Set the internal Revit representation and update the ElementId and UniqueId
area:

Revit.Elements.Area.Boundaries
Returns the boundary segments of the area.

Revit.Elements.Area.FromExisting(Autodesk.Revit.DB.Area,System.Boolean)
Construct an Element from an existing Element in the Document
area:
isRevitOwned:
Returns: